#include <bits/stdc++.h>
using namespace std;

int a[10001];
             
int main() {
    int L, H, R;
    int mx = 0;
    int mn = 10000;
    while (cin >> L >> H >> R) {
        mn = min(L, mn);
        mx = max(R, mx);
        for (int i = L; i < R; i++) {
            a[i] = max(a[i], H);
        }
    }
    for (int i = mn; i <= mx; i++) {
        if (i == mx && a[i] != a[i-1])
            cout << i << " "<< a[i];
        else if (a[i] != a[i-1])
            cout << i << " "<< a[i] << " ";
    }
    cout << "\n";
}

// a[1..5] = 11
// a[2..7] = 6
// a[3..9] = 13
// 1  2  3  4  5  6 7 8 9 10 11
// 0  0  0  0 ...
// 11 11 11 11
//    6  6  6  6  6
//       13 13 ...

//   i:  0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18  19  20  21 22  23                     29
// a[i]: 0 11 11 13 13 13 13 13 13  0  0  0  7  7  7  7  3  3  3  18  18  18  3  13  13  13  13  13  13  0
//    1 11  3 13  9  0 12  7 16  3 19 18 22 3 23 13 29 0

        // 高度不同於上一個時，輸出x座標。i.e. 高度改變時，輸出x
        /*if (a[i] != a[i-1]) cout << i << " ";*/

        // 什麼情況要輸出高？
        // Q: 為何 i=1 時，這個 if 陳述句不會執行?
        // 檢查當前高度是否重複上一個 
        /*if (a[i] != H) { */
        /*    H = a[i];*/
        /*    cout << a[i] << " ";*/
        /*}*/

        // 記錄每一建築高
        // 1..5 = 11
        // 2..7 = 6
        // 2..4 重疊，取最大值
        // i.e. 每次讀入都要比較最大值
        
        // 什麼情況要輸出x座標
        // 什麼情況要輸出高？

        /*if (a[i] != a[i-1]) {*/
        /*    cout << i;*/
        /*} else {*/
        /*    cout << a[i];*/
        /*}*/
        
        // 輸入進來的H大於當前高度a[i]，則更新當前高度
        // if (H > a[i]) { a[i] = H; } 其實可以寫成 a[i] = max(a[i], H);


/*1 11 3 13 9 0 12 7 16 3 19 18 22 3 23 13 29 0*/
/*1 11 3 13 9 0 12 7 16 3 19 18 22 3 23 13 29 0*/
/*1 11 3 13 9 0 12 7 16 3 19 18 22 3 23 13 29 0 %*/

/*
範例輸入 #1
1 11 5
2 6 7
3 13 9
12 7 16
14 3 25
19 18 22
23 13 29
24 4 28

範例輸出 #1
1 11 3 13 9 0 12 7 16 3 19 18 22 3 23 13 29 0

*/
